[
  {
    "name": "How to Build a High-Performing Team in Event Technology",
    "description": "In the fast-paced world of event technology, success hinges not just on technical skill, but on the synergy, mindset, and resilience of your team. Drawing from real-world experience building and leading global event tech teams, this session dives into the wins—and the hard-earned lessons—of assembling a high-performing group from the ground up.\nWhether you're scaling a team or refining one, you’ll walk away with insights on how to look beyond resumes, hire for potential and personality, and lead with authenticity.\nKey Takeaways:\nWhy qualifications alone don’t guarantee a great hire\nThe intangible traits - like curiosity and grit - that can outperform hard skills\nHow transparent leadership builds trust and drives performance\nFormat: Fireside chat or case study"
  },
  {
    "name": "Is the Event Tech Industry Parent-Friendly?",
    "description": "Juggling the demands of a fast-paced event tech career with the responsibilities of parenting is no easy feat. Yet it’s a challenge many in the industry quietly navigate every day. This session will explore the often-unspoken truth behind “doing it all”: the invisible support systems, including stay-at-home partners, paid help and informal family networks, which all make it possible.\n\nWe’ll ask tough but necessary questions: Is the event tech industry genuinely parent-friendly, or do we only hear from those who have the resources to outsource care and household responsibilities? What can we learn from those trying to balance work and family without a safety net? And what should the industry be doing to better support working parents at all levels?\n\nWhether you’re a parent, an employer, or an ally, this session will challenge assumptions, spotlight real experiences, and push the conversation on inclusion and sustainability forward."
  },
  {
    "name": "From Optional to Essential: How Ottobock Transformed Their Event Experience",
    "description": "When Ottobock Healthcare first partnered with VenuIQ, their events ran with minimal event tech. No app, no automation, no real-time analytics. Fast-forward three years, and the event app has become a critical part of their event delivery model.\n\nIn this engaging fireside chat, we’ll explore Ottobock’s journey from initial audience reactions to full adoption. Our goal, revealing what worked, what didn’t, and what ultimately made the difference. You’ll hear directly from the Stuart how the technology moved from “nice-to-have” to “mission-critical,” and how they now use integrated features like session engagement, information sharing, and post-event reporting to deliver smarter, more effective events.\n\nWhether you’re running events for a global brand or a small team, this session will give you actionable insights into adopting technology with purpose, scaling usage, and delivering results that your stakeholders can see."
  },
  {
    "name": "The FFAIR Podcast: How we made 2025 the year exhibitors met deadlines",
    "description": "FFAIR’s mission is to Make Exhibiting Easier. In 2025, they set out to boost exhibitor engagement and delivered: exhibitor deadline compliance jumped from 65% in January to an average of 95% by Q4.\nHow did they do it? What’s behind this surge in exhibitors hitting deadlines? And what impact has it had on organiser teams? Tune in to find out. Host and Guest Info: Adam Jones, Lisa McBride and Katie Whatley - FFAIR"
  },
  {
    "name": "Maximising the International Attendee - More than Just Words",
    "description": "The proliferation and advancement in AI-based translation services has made delivering content in-language easier than ever before. Microsoft, Google, ChatGPT offers many of you immediate (and often free!) in language offers for you to take to your customers. \n\nWith an explosion in global events, the KPIs are changing. Companies are looking for their global events to be revenue generating versus costs centers, which makes the international attendee more important than ever before.\n\nLearn more about the strategies and systems that F1000 organizations are putting into place to maximize the impact of the international events – and how interpretation and captions are just the tip of the iceberg to ensure your event is a success."
  },
  {
    "name": "The Changing Landscape of Awards – Insights from the Experts",
    "description": "Join this 30-minute session for a deep dive into the future of awards management. Discover the latest trends, insights, and industry predictions – and get an exclusive first look at a new report by Event Industry News in collaboration with Evessio. Gain practical tips, explore best practices, and hear expert perspectives to help you manage, plan, judge, sponsor, or influence awards with confidence in an evolving landscape."
  },
  {
    "name": "Experiential Futurists: The Future of Experiential and Audience Engagement is Immersive Tech as Humans Become More Enmeshed with Literal Technology",
    "description": "As technology becomes inseparable from daily life, understanding how it reshapes consumer expectations and behaviours is critical. INVNT has pioneered immersive, audience-led activations, shaping next-gen brand experiences. This session distils these lessons into guiding principles for event professionals seeking to stay ahead of the curve.\n\nTakeaways:\n\n- Shift mindset, from speaking at audiences to collaborating with them: Drawing on INVNT’s work with brands like Lamborghini, the talk explores how participatory experiences, co-creation in art, music, or Web3, forge deeper emotional connections.\n- Spotlight on immersive tech in practice: From mixed-reality activations to NFT drops tied to physical-world assets, we uncover how VR/AR, IoT, digital twins, blockchain, and metaverse platforms are revolutionising storytelling, placing attendees at the heart of the experience.\n- Turning immersive moments into high-impact ROI: We dive into case studies where innovative activations delivered record-breaking engagement: multimillion-dollar auction results, tens of millions of media impressions, and brand evolution in real time.\n- Real-world tips for creative tech adoption: Learn actionable strategies, from topic ideation to seamless tech integration and post-show evaluation, that event professionals can apply immediately to enrich attendee experiences and boost sponsorship value.\n\nSupporting Case Studies: PepsiCo, Barcelona IBC, COP28, ABB-e AI Mascot from ABB + global events for ABB/HV\n\nThis session offers a forward-thinking roadmap for immersive, co-created experiences that transcend traditional formats, speaking directly to developers, organisers, marketers, and futurists who want to implement cutting-edge tools like AI, XR/VR/AR, blockchain, and digital twins for memorable, audience‑centered storytelling.\n\nIf you’re ready to lead the next generation of experiential events, where attendees collaborate, explore, and feel, you won’t want to miss this. Join Claudia and Peter to explore how immersive technology and audience-driven creativity can amplify your impact, inspire deeper connections, and redefine brand storytelling in the age of digital enmeshment.\n\nKEY THEMES: Mindset shift frameworks, tech adoption guidance, high‑impact case studies, practical execution roadmaps"
  },
  {
    "name": "The Missing Millions: Ramp Up Your Event ROI By Turning Untapped Event Data Into Retention, Revenue And Results That Matter",
    "description": "Most event organisers know how to report on attendance. They can share registration numbers, seminar uptake, and perhaps how many badges were scanned. But when it comes to using that data to drive commercial success - to retain sponsors, secure exhibitor rebookings, improve future strategy or grow long-term revenue – the industry is missing a huge opportunity.\n\nWhy? Because data is often seen as a post-event reporting task, rather than a strategic tool for influencing what happens next. And let’s be honest, most of us find it pretty tough to understand how to boil down these complex insights into something we can actually make use of.\n\nEvent organisers are often so busy tracking performance that the golden insights into value delivered are often overlooked. Yet with commercial partners demanding clearer evidence of value, that disconnect puts future bookings at risk. \n\n• It matters when you can’t prove ROI to the people funding your event.\n• It matters when your biggest exhibitors say they’re “thinking about next year”\n• It matters when you need hard evidence to justify pricing or defend a budget.\n\nThis session is a chance to rethink the role of data in your event. To see it not just as a retrospective, but as a commercial asset that should take centre stage.\n\nLed by Sarah Cox, Managing Director at Jonas Event Technology, this session is designed for organisers who want to:\n• Stop relying on gut feel, anecdotal feedback and goodwill of existing relationships to retain sponsors and exhibitors\n• Identify the unseen value hidden in the data they already collect\n• Learn how to easily build data into your event’s commercial strategy \n• Create stronger, more evidence-based conversations with stakeholders\n• Understand what forward-thinking organisers are doing differently to turn insight into renewal, upsell and long-term revenue\n\nThis isn’t a talk about tools or tech stacks. This session is about shifting perspective and not getting left behind. Gain the inside track on how industry leaders are turning their stats into commercial gold. It’s time to stop treating data as admin and start using it as leverage.\n\nThe good news is, putting your event data to work doesn’t have to feel complicated. \n\nYou’ll leave with a clearer understanding of what’s been missing, what’s now possible, and how to move from reporting on your event… to growing it.\n\nRemember, if you can’t prove the value you’ve delivered, you can’t sell it again.\n\nAnd if you’re not using your data commercially, someone else will."
  },
  {
    "name": "Associations Meet-up",
    "description": "Membership World, a leading association and membership network is delighted to host a networking and meetup for those in associations. We will be sharing a number of ideas to engage your membership at events, including Ai hackathons, Top 100 Most Influential People Indices, AI Speed Networking, and Cool Fun, Inspiring ideas.\n\nRegister for this session to make sure you don't miss out"
  },
  {
    "name": "From Attendee to Contributor: The ROI of Real Connection",
    "description": "Connection isn’t just a soft skill, it’s good for business. But not all participation is created equal. Some event experiences are extractive: attendees show up, take in content, and leave. Others are generative: people connect, co-create, and transform the experience for everyone involved. In this candid conversation, Christine Renaud (Braindate) and Vanessa Lovatt (Event Tech Live) explore how event technology can help shift your audience from passive to participatory, and why investing in real connection doesn’t just build community, it earns loyalty, and lays the groundwork for lasting growth.\n\nIn this session, you will:\n- Learn how to turn passive audiences into active contributors who co-create value.\n- Discover the ROI of genuine human connection for both attendees and event organizers.\n- Explore practical ways event technology can foster deeper engagement and loyalty.\n- Walk away with strategies to design events that don’t just inform, but transform.\n\nThis conversation is for event leaders who want to create experiences that feel personal, participatory, and worth returning for. You’ll leave with ideas you can act on and a clearer vision of how connection builds not only better events, but also stronger communities and smarter businesses."
  },
  {
    "name": "The Neuro-Triggered Event: Designing Tech-Driven Touchpoints That Stick",
    "description": "Attendees don’t remember everything — they remember what their brain is wired to retain. This session explores how neuroscience can guide more strategic use of event technology to maximize attention, emotional engagement, and long-term impact.\n\nFrom multisensory mapping and behavioral cues to emotional analytics and cognitive offloading, you’ll discover how to use tech not just to deliver content, but to shape experiences that influence what people feel, remember, and do.\n\nWe’ll examine:\n\n* The neuroscience of attention — and how tech can support (or sabotage) it\n* Using digital tools to activate trust and memory pathways\n* Real-world examples of tech touchpoints that drive cognitive impact\n* A framework to evaluate your current tech stack through a neuro-lens\n\nYou’ll leave with clear, science-backed strategies to design intentional, tech-enhanced moments that resonate, long after the event ends."
  },
  {
    "name": "The Organisers Ultimate Content Creation Tech Stack",
    "description": "What you need to generate valuable, year-round content from your event.\n\nFrom in-person session scheduling management, live streaming and on-demand content access, to real-time AI summaries, the ultimate off-the-shelf content creating tech stack partners, as used by ETL discuss how working together across multiple events has created a blueprint for success, allowing organisers to save time whilst building high-engagement events.\n\nWith new formats to increase participation across in-person and virtual audiences, extend event reach, and maximise long-term content use, you’ll leave with clear ideas to implement at your next event!"
  },
  {
    "name": "Making Global Simple: How AI Speech Translation Powered the Education World Forum 2025",
    "description": "When you bring together 120+ education ministers from around the globe to discuss policy, data, and innovations about their respective education systems, language can easily become the biggest barrier to an inclusive exchange. At the Education World Forum 2025, held in London, seamless AI-powered speech translation turned that challenge into an opportunity, enabling every delegate to access the full program in their own language.\n\nIn this session, KUDO and PH Production Services will take you behind the scenes of the world’s largest gathering of education ministers to reveal how they delivered real-time language accessibility at scale.\n\nThrough live discussion, photos, and insider perspectives, attendees will learn:\n- How to plan and implement live speech translation at a global ministerial event\n- The role of AI + human expertise in delivering flawless accessibility\n- Lessons learned in AV production, integration, and user experience\n- Why simplicity of access (QR codes, captions, mobile devices) was critical to success\n- The ROI and long-term value of making language accessibility standard, not optional"
  },
  {
    "name": "Tech Demo: Captello",
    "description": "\"Enhancing Attendee Engagement and Maximising Event ROI\"\n\nIn this 15-minute tech demo, Daniel Mortimer, Head of EMEA, will explore how advanced event technology is designed to meet the evolving needs of event organisers. From personalised lead capture to seamless attendee connections, discover how to elevate engagement, optimise activations, and drive measurable results.\n\nThis session will showcase how the latest solutions can:\n\nPersonalised Lead Capture: Enable real-time tracking and engagement to maximise lead quality and follow-up opportunities.\n\nInteractive Engagement & Activations: Boost attendee participation through innovative tools that increase brand exposure and create unforgettable event moments.\n\nMeaningful Connections for Attendees & Exhibitors: Discover how Connexions, our app-less digital business card solution, can transform networking at your events. Attendees and exhibitors can easily exchange contact details with a simple tap, creating instant, meaningful connections without the need to download an app. This seamless solution simplifies follow-ups and ensures valuable, long-lasting interactions throughout the event.\n\nEvent Generation for Better Results: EventGen: A simple solution for event registration, check-in, and badge design and production. Streamline your event processes with an efficient, user-friendly platform that simplifies attendee registration, ensures smooth check-ins, and creates customised badges quickly and easily.\n\nCaptello seamlessly integrates all these solutions, helping you collect more data across your entire event and providing better insights to accurately measure ROI.\n\nJoin this session to learn how to implement tech-driven solutions that enhance event experiences and drive tangible business outcomes."
  },
  {
    "name": "Click, Confirm, Attend: The Art of Flawless Event Registration",
    "description": "This session is designed to equip event organisers and planners with the skills to design an ideal registration experience that is intuitive, enjoyable, and brand-reinforcing. By breaking down the registration journey into essential stages - from initial sign-up to final confirmation - the session highlights strategies for creating a seamless, friction-free process that boosts attendee satisfaction and maximises conversions.\n\nAttendees will gain insights on optimising registration touch points, including first impressions on landing pages, simplifying user flows, designing mobile-friendly interactions, and building trust with secure, transparent data practices. Practical tips will be shared on adding value through follow-up communications, such as personalised confirmation emails and reminders.\n\nThe session will include real-world case studies, demonstrating how a well-designed registration journey can enhance attendee engagement and increase conversion rates."
  },
  {
    "name": "How to Make First Touch Frictionless with Radical Registration & Badass Badges",
    "description": "Registration and badging set the tone. In this fast, practical panel, you’ll see how to make first touch frictionless: wallet passes and QR that fly at peak, on-demand print with low waste, tap-to-pay for walk-ins, and privacy-safe ID flows. You leave with a clear spec, sample KPIs, and fixes you can ship at the next show.\n\nWho it’s for:\n\nTradeshows needing flow and clean data.\nAgencies scoping reliable door tech.\nCorporates balancing speed, brand and security.\n\nOutcomes (what you take away)\n\nA simple flow that hits sub-15s check-in with wallet passes or QR.\nA print setup that reduces jams and waste.\nA plan for walk-ins, reprints and VIPs.\nA privacy crib sheet for “face at the door”.\nA one-page spec you can brief to ops or suppliers."
  },
  {
    "name": "Practical applications for AI in events: What's noise and what's worth the hype?",
    "description": "As AI begins to infiltrate the event technology space, organizers are trying to understand ways in which it can actually help their events. While organizations launch new 'AI-powered' features, not all AI capabilities are built the same. How is an organizer to choose AI features that can bring their events value? To find the true value of these features, they need to accomplish one of three things: reduce resource input during planning & execution, improve stakeholder experiences, or drive monetary action (i.e. sales, leads, etc.)\nJoin Muhammad Younas, CEO of vFairs, as he discusses the true value of AI at events, what to consider when choosing AI-powered features, and how to cut through the noise."
  },
  {
    "name": "Event Tech Talk Show: From Captions to Connection: Rethinking Multilingual Experiences",
    "description": "Join us as TransPerfect’s Nate Fong reveals how AI, language tech, and smarter localization strategies are transforming global events—and why connecting with international audiences means going far “beyond words.”"
  },
  {
    "name": "ILEA Meet-up",
    "description": "The International Live Events Association (ILEA) is the principal community representing creative event professionals, globally. \n\nOur mission is to ensure an inclusive, thriving and impactful global creative events profession by providing our members and stakeholders with:\nCollaborative Networking – Build meaningful, cross-border relationships\nEducation & Professional Development – Elevate skills and careers\nInspiration – Share ideas, trends, and creativity\nIndustry Advocacy – Recognise and champion the value of live events globally\n\nThis session will provide more insight into ILEA's global activities and how this could benefit event organisers and suppliers around the world and why you should become a member."
  },
  {
    "name": "Make It Last: How to Turn Event Content Into Year-Round Impact",
    "description": "Content is the engine behind every great event, but too often, it stops once the session ends. What if your event content could continue to deliver value well beyond the day itself?\nIn this session, we’ll explore how to design event content that connects in the moment and drives impact across your wider marketing strategy. \nWe’ll cover:\n1. Creative ways to bring content to life across digital and in-person events\n2. Why repurposing your event content is a non-negotiable\n3. How AI tools can help you scale smarter, not harder"
  }
]
