[
  {
    "company": "Wizard Event Technologies",
    "description": "Events Wizard is the modern solution for professionals who demand more than event management. Designed to streamline logistics, elevate brand presence, and foster real attendee interaction, it is where advanced technology meets smart design. You don’t just organize events — you create experiences."
  },
  {
    "company": "Bizzabo",
    "description": "Bizzabo’s Event Experience OS is built for flexibility, customization, and integration, so your team can manage every event format in your portfolio – all in one place. \n\nBizzabo's Event Experience OS\nModern event tech, without the legacy baggage\n\nBizzabo offers all the event management software features you expect, but built on a flexible, customizable, open platform. Scale your events with ready-to-use tools, or create custom integrations to fit your unique needs."
  },
  {
    "company": "ReelFlow",
    "description": "ReelFlow helps you engage event website & landing page visitors by adding short, interactive videos to humanise your brand, increase engagement, and guide visitors through their journey."
  },
  {
    "company": "Evolution dome",
    "description": "Inflatable Event Structures.\nMeeting Pods - Breakout Rooms - Seminar Theatres "
  },
  {
    "company": "Waygo Maps",
    "description": "Waygo is a mapping platform that turns static floor plans into interactive digital maps saturated with event and venue content so exhibitors get the most visibility and attendees make the most of the event."
  },
  {
    "company": "JacobsMassey",
    "description": "JacobsMassey is exhibiting in partnership with Middlesbrough College at this year’s “Event Tech Live”. Come and see us at stand E61 just to the right of the ETL Main Stage where we will be discussing AV Apprenticeships, Career opportunities and Production services. Our team will be livestreaming interviews with leading AV professionals and employers offering advice and career guidance. If you or anyone you know maybe considering a career in AV then this is a fantastic opportunity to meet the AV Apprenticeship recruitment team in-person from Middlesbrough College. Find out everything you need to know about becoming an AV Apprentice or hiring one. You can even meet Audiovisual Technician Apprentices who will be supporting the AV on our stand alongside the JacobsMassey Production team. Quiz them on what it is like to be joining our amazing industry and their experiences of the course so far …"
  },
  {
    "company": "Target Response",
    "description": "Target Response have been supplying quality databases for forty years since 1985 and have been members of both the Meetings Industry Association and British Promotional Merchandise Association since 1993. We are also a Charity Partner with Meeting Needs, the events industry charity."
  },
  {
    "company": "Aletheia Events, Inc.",
    "description": "Reserve a demo time at http://bit.ly/43TWZIc           Aletheia is the only AI-powered intelligence platform for event operations. Built for modern event teams, it integrates with the tools planners already use to centralize details, automate busywork, and instantly generate high-value deliverables. Workflow-trained AI agents handle research, document analysis, vendor evaluations, and more, all within a live, customizable dashboard. By cutting repetitive steps, Aletheia saves teams an average of 1.5 days each week, speeds up task completion, and lowers reliance on outside support. The result is smarter planning, measurable cost savings, and more time to deliver unforgettable event experiences."
  },
  {
    "company": "Bondai",
    "description": null
  },
  {
    "company": "Holon - hardware rental & solutions",
    "description": "Holon, for some a new name for onsite event registration solutions. With over 20 years experience in event registration, Holon offers independent name badge printing, lead scanning, session management, and support for any event registration platform. As an organizer you can choose to rent only our hardware such as printers and kiosks or tap into our experience to also let us take care of the onsite registration deployment. Flexible solutions for all events, seamless logistics and probably one of the largest inventories of name badge printers in Europe. Curious how Holon can make your onsite registration more efficient? Visit us at the MESA Members' Hub."
  },
  {
    "company": "vFairs",
    "description": "vFairs is an all-in-one event management platform that helps event planners and professionals manage the entire event lifecycle. With over a decade of experience serving over 20 million attendees globally, vFairs specializes in helping organizations host exceptional in-person, virtual, and hybrid events.The event tech software provides features to run your events from start to finish, including event registration, ticketing, custom event sites, check-in and badge printing software, branded mobile app, lead capture app, and virtual events software. To augment the planning process, event planners can use our budget tracking, accommodation management, and abstract management tools. During the event-building stage, self-serve features like the landing page builder, floor map, seating planner, and mobile app make your job easy. You can save time and market your events better by using vFairs AI-powered content generation and repurposing tools. During the event, badge printing and check-in app, lead capture app, mobile apps, and virtual event software can power every aspect of your event from event entry to content uploads and engagement to gamification. Event planners can also facilitate networking with the AI matchmaking feature.To support the post-event stage, event planners can get detailed reports from the backend, get quick stats from the AI reporting chatbot, host content on-demand, and nurture contacts captured through email campaigns.vFairs supports 2000+ integrations including CRMs, ATS, and Martech solutions. To ascertain enterprises with the highest level of data privacy and security standards, vFairs is SoC-2, GDPR, and ISO-27001 compliant. Our platform caters to both 'done-by-you' and 'done-for-you' models for maximum flexibility. Complimentary project management easy-to-use wizards and drag-and-drop interfaces make it easy to set up and configure events in real-time. vFairs’ vision is to become the trusted and loved way of hosting events for customers. From winning 'loved by users badge' to 1400+ raving customer reviews on G2, getting Abbott’s Partner of the Year award for 2023, being named ‘Visionary’ in the 2024 Gartner® Magic Quadrant for event technology platforms, and becoming Customers’ Choice in the 2023 Gartner® Voice of the Customer for Event Technology Platforms report - vFairs continues to embody this vision and trust."
  },
  {
    "company": "Vividink Public Relations & Social Media",
    "description": "Tired of PR that's... pants?\n\nYou have groundbreaking tech, an awesome event or a staggering service. So why does your PR effort feel like a pair of ill-fitting, bargain-bin briefs?\n\nPerhaps it’s the 'revolutionary' AI tool that just spams 500 journalists with the same generic pitch. Or the agency that promised the world but failed to build the relationships to deliver it. Or maybe it's just the dawning realisation that building a real reputation requires more than a software subscription.\n\nThe result is always the same: no coverage, wasted budget, and a distinct 'pants' outcome.\n\nAt Vividink, we believe PR needn't be pants.\n\nWe're the bespoke suit in a world of fast-fashion PR. We build relationships, we create strategies, and we use our human brains to tell stories that journalists actually want to read. We treat AI as a co-pilot, not an autopilot.\n\nStop exposing your brand to bad PR. Come and find us at Stand B1.\n\nWe’ll be offering complimentary 15-minute 'PR Fit-Checks'—no-nonsense, straight-talking advice to see if your current strategy is... well, exposing you, or actually supporting you.\n\nLet's find a better fit."
  },
  {
    "company": "Stream7",
    "description": "Put your feet up and have a cuppa – we’re bringing a bit of Sheffield to Event Tech Live.Stream7 is an event production company specialising in Hybrid Events, Event Streaming, Virtual Events, Content Creation, Event Studios and Event Production. With over a decade of experience, we’ve been at the forefront of event broadcasting – combining smart technology with creative expertise to deliver standout events that connect audiences across the globe.Whether you need great visuals, seamless streaming, or help with all the tech behind the scenes, our in-house team has it covered. From videographers and sound engineers to production managers and network specialists, we bring everything together to deliver professional, broadcast-quality events.At Stream7, we treat every event like it’s our own – partnering with clients around the world to provide flexible, high-quality solutions that make sure no moment is missed, no matter where your audience is. So come say hello, have a brew, and let’s chat about how we can help take your next event further – powered by Yorkshire tea and proper production."
  },
  {
    "company": "Virtual Creator Studio",
    "description": "Elevate your virtual and hybrid events with Virtual Creator Studio (VCS) — a first-of-its-kind, no-code DIY platform that empowers event professionals to build and host fully branded virtual experiences in just a few clicks. Designed for flexibility, speed, and seamless integration, VCS puts the power of event creation directly in your hands. Design immersive, branded experiences — all without writing a single line of code. Launch in minutes. VCS is intuitive, simple, and built for rapid deployment. Plug and play with your existing tech stack — including streaming, webinar, registration, and CRM tools. Customize everything — from lobby to livestream to exhibits with user-friendly, intuitive controls. \nReach everyone. Deliver inclusive, on-brand virtual events that scale across audiences and industries. Obtain Valuable Insights with an analytics dashboard. \nDiscover what’s next in virtual event technology. Visit us at the Launchpad (LP3) and see how VCS is reimagining the future of virtual engagement."
  },
  {
    "company": "Silent Seminars",
    "description": "Silent Seminars, provides award-winning audio solutions, and can help plan, build and deliver audio at conferences, exhibitions & live events, reducing noise, increasing engagement and accessibility, maximising space, and even translating languages. The company has a distributors in Europe, USA, APAC and Middle East."
  },
  {
    "company": "Eventmobi",
    "description": "Since 2009, EventMobi’s comprehensive feature set and elegant simplicity have been loved by 30,000+ planners and millions of attendees. EventMobi has powered events for top brands like Visa and TD Bank, and associations including the American Political Science Association and International Society for Heart and Lung Transplantations. One of the industry’s first Mobile Event App platforms, EventMobi’s comprehensive suite of event management tools now includes Registration, Check-in, Lead Capture, and Badge Design and Printing. Simple pricing options, award-winning customer support, and a complete range of production services make EventMobi the preferred choice for organizers of meetings and conferences that demand high attendee engagement.\n"
  },
  {
    "company": "ePlannerPro",
    "description": "ePlannerPro is a comprehensive platform enabling exhibitors to streamline meeting management at trade shows and conferences."
  },
  {
    "company": "Tech2Grow",
    "description": "Showcase Your Event Tech with Tech2Grow at ETL LondonJoin the Tech2Grow Pavilion at Event Tech Live London — the global hub for innovation in event technology. This cost-effective, hassle-free stand partnership puts your brand in front of high-level event planners, organisers, and decision-makers. With 89% of ETL attendees involved in purchasing decisions and over £1.25B spent annually on event tech, this is the place to be seen. New for 2025 – Pavilion exhibitors receive free access to an exclusive Growth & Expansion Masterclass and Speed Partner Networking to fast-track connections with buyers, distributors, and partners.️ Spaces are limited – to enquire about participating, email enquiries@eventtechlive.com."
  },
  {
    "company": "ADITUS GmbH",
    "description": "For over 25 years, ADITUS GmbH has been digitising the trade show world. We are event professionals for trade shows, congresses, and major events: from ticketing and intuitive admission systems to marketing and full service. We provide simple handling for organisers, exhibitors, and visitors. Make your event even more successful with ADITUS‘ solutions: software, hardware, services, and marketing - all from a single source #visitorgrowth."
  },
  {
    "company": "Present Communications",
    "description": "We provide the support, expertise and technology to tell your story. Live events, podcasts, video, broadcast.Live events | Video | PodcastsOur expertise in broadcast and hybrid events over the last fifteen years makes us well placed to deal with the complexities of today’s multi-location events, activations and shoots."
  }
]
