[
  {
    "name": "Lydia Ritchie",
    "description": "Lydia Ritchie is a Field Events Marketing Manager at Deel, where she leads regional event strategy and execution across EMEA. She manages large-scale industry tradeshows as well as intimate, localized events that bring Deel closer to its clients and partners. Passionate about building connections through events, Lydia designs experiences that highlight Deel’s global reach while driving meaningful local engagement."
  },
  {
    "name": "Faisa Mohamed",
    "description": "Faisa is a multi-disciplinary community professional with a deep-rooted passion for connection, culture, and care. She is the UK Community Program Manager at Notion and co-founder of Somalis in Tech, a global community creating visibility, connection, and opportunities for Somali talent in the tech industry. With experience across companies including Meta and Bumble, Faisa’s work focuses on building meaningful communities and bridging local impact with global goals."
  },
  {
    "name": "Rodney Hart",
    "description": "Hart is a seasoned events leader with expertise in both in-person and digital strategies. Early in his career, he optimized onsite technology for large-scale enterprise events, later guiding major conferences through successful digital and hybrid transformations. Now VP of Events at RainFocus, he oversees the event portfolio, using data and the RainFocus platform to maximize impact and measure ROI across formats."
  },
  {
    "name": "Lou Kiwanuka",
    "description": "Event operations is where I help people cut through chaos and find their flow. I founded The Ops Nest, a learning community for the people holding everything together behind the scenes - part knowledge hub, part support network, part “who knows a decent supplier for this mess?”.  ￼\n\nI’m also building One Change Method, born from a simple experiment: make one meaningful shift each month. It’s now a way for people and teams to create change that sticks - small steps, no guilt, no overwhelm.  ￼"
  },
  {
    "name": "Christopher Velez",
    "description": "Christopher Velez is a Sales Professional originally from Detroit, Michigan. After graduating from Central Michigan University in 2013, Christopher moved to Dallas, Texas to pursue his professional sales career. He has worked in the event technology industry foChristopher Velez is a sales professional with over 10 years of experience in the event technology industry. Throughout his career, he has worked with a range of event tech companies, including Cvent, JiffleNow, and Lanyon. When he's not helping his clients, Christopher enjoys spontaneously traveling around the world."
  },
  {
    "name": "Claudia Cafeo",
    "description": "She leads the NoCodeOps community, connecting automation experts, operators, and GTM teams through enablement programs, partner showcases, and hands-on co-building sessions that accelerate real adoption of AI and workflow automation inside organizations.\n\nShe is also the founder of Floxies, a global community empowering women in design and Webflow.\nFloxies has helped thousands of creatives grow skills, confidence, and careers.\nClaudia’s leadership has been recognized across the industry, including earning Community MVP at Webflow Conf.\n\nDriven by a belief that the future of work is built collaboratively, Claudia focuses on turning real practitioner knowledge into shared progress.\nHer work makes AI and automation more accessible, more human, and more impactful for the people who use it every day."
  },
  {
    "name": "Daniel Mortimer",
    "description": "Daniel Mortimer is a dynamic and results-driven professional with over a decade of experience leading and managing high-profile events across the UK, UAE, and Australia.\n\nA true innovator, Daniel is passionate about challenging the status quo and finding unique solutions to deliver exceptional event experiences.\n\nWith a background in project management and a PRINCE2 certification, Daniel has honed his skills in driving successful event strategies and delivering tailored solutions that break the traditional mould. His expertise spans across regional and key account management, where he has consistently exceeded client expectations and built lasting relationships based on trust and results.\n\nCurrently serving as the Head of EMEA at Captello. Daniel is at the forefront of delivering cutting-edge event strategies for organisations globally. His previous leadership roles include Regional Director at ExpoPlatform and Event Director at Hannover Fairs Australia, where he managed renowned events such as CeMAT Australia, CEBIT Australia, and SMB Digital.\n\nKnown for his meticulous attention to detail, strategic mindset, and ability to organize and execute with precision, Daniel thrives in fast-paced environments. He is equally comfortable leading high-level strategy or rolling up his sleeves to ensure every aspect of an event is flawlessly executed. A team player at heart, Daniel’s collaborative approach and infectious enthusiasm make him a valued asset in any event team.\n\nDaniel’s unique blend of leadership, creativity, and operational expertise makes him a trusted partner for event organisers seeking innovative solutions and exceptional event outcomes."
  },
  {
    "name": "Eli Amar",
    "description": "Eli Amar is the Founder and CEO of Wizard Event Technologies. With a strong background in marketing, sales, and product leadership, Eli combines strategic vision with hands-on innovation. Under his leadership, Wizard has grown into a leading provider of event registration and digital event solutions, trusted by organizations for its user-friendly design, security, and customer-focused service."
  },
  {
    "name": "Anup Mohan",
    "description": "Anup Mohan is the Founder and CEO of Premagic, an AI-powered event tech platform designed to boost organic event marketing. A serial tech entrepreneur and experienced growth hacker with a strong understanding of unit economics, Anup has built, scaled, and sold multiple startups. He has won prestigious awards, such as Tie-Kerala—Innovator of the Year 2023, and his company, Premagic, has won gold at the WOW Awards Middle East 2024 for its valuable contribution at GITEX GLOBAL 2023."
  },
  {
    "name": "Jack Newey",
    "description": "As Chief Commercial Officer at Mash Media, Jack Newey leads commercial strategy across one of the UK’s most influential media groups in the MICE industry. He brings dynamic vision and commercial acumen to some of the sector’s flagship events and publications, including International Confex, Conference News, and Exhibition News.\n\nPreviously Group Portfolio Director and Event Director of International Confex, Jack has been instrumental in transforming the landscape of event engagement, elevating brands through bespoke activations and deeply integrated content campaigns. His leadership has brought initiatives such as the CN Global Event Tech Summit, CN Sustainability Summit, and CN Agency Leaders Summit into the spotlight as must-attend forums for industry innovation.\n\nJack is widely recognised for championing future-facing strategies that connect buyers and suppliers in meaningful ways, with a sharp focus on event tech, sustainable operations, and commercial creativity. Under his guidance, International Confex has cemented its reputation as the UK’s biggest event for event professionals, hosting over 5,000 attendees and 300+ exhibitors annually at Excel London.\n\nPassionate about driving results and nurturing long-term industry partnerships, Jack continues to influence the next generation of event professionals and thought leadership."
  },
  {
    "name": "Adam Lewis",
    "description": "Adam Lewis is Co-Founder and Commercial Director at BBD Boom, a UK HubSpot Elite Partner, working with B2B organisations, including event organisers and brands, on CRM implementation, data migration, integrations, AI enablement, and RevOps. With 20+ years’ experience across 500+ HubSpot projects, he leads programmes from design through adoption and long-term optimisation, keeping the focus on practical outcomes across tech, process, and teams."
  },
  {
    "name": "Ade Allenby",
    "description": "Offering Consulting and Project Contracting Services, specialising in helping Event Organisers and Event Technology Vendors take products to market and scaling events using Digital tools.\n\nA commercially focused senior leader of Digital Product delivery and revenue growth with international experience. Skilled in transforming online capabilities and creating customer value using the latest technologies.\n\nExperienced at leading diverse projects delivering digital transformation. Adept at balancing the strategic requirements and vision of multiple stakeholders, whilst ensuring the achievement of deadlines and financial benefits, with adherence to business priorities.\n\nAn accomplished leader of global cross-functional teams. Proven track record of developing deep customer understanding to underpin and guide complex online change programmes.\n\nSpecialties: Digital Strategy, Revenue growth, Online Marketing, Digital Product Development, Product Innovation, Project Management, Customer Engagement, Go-To-Market Strategy, Sales Pitches and Messaging."
  },
  {
    "name": "Will Bayne",
    "description": "Will Bayne is the driving force behind one of the UK’s fastest-growing event tech companies. As CEO and Founder of Sitka, he leads a platform that’s transforming how organisers use data, navigation, and digital tools to deliver better event experiences.\n\nWith a background in UI design and a career built in asset tracking and connected systems for companies including JCB, Will entered the events space as an outsider – and that’s exactly what allowed him to disrupt it."
  },
  {
    "name": "James Tucker",
    "description": "James Tucker is the CEO of GovNet, a UK-based exhibition and training provider that specialises in running events for the UK public sector. James has used technology and positive company culture to transform a quarter-century-old company into a modern media business dedicated to improving society’s outcomes through better public services. Previously, he was an equity fund manager in Emerging Markets and US technology, but he wanted the chance to be a bit more hands-on in transforming and growing companies, rather than just investing in them, so he took the plunge and hasn’t looked back since."
  },
  {
    "name": "Knut Amund Gulsvik",
    "description": "Knut Amund Gulsvik is Chief Commercial Officer at Qondor, where he applies a background in management consulting to transform how agencies run events. Known for combining a tech-driven mindset with a knack for simplifying complex challenges, he helps teams turn backstage chaos into streamlined systems that unlock extraordinary client experiences. A proud Norwegian, Knut brings the same determination he shows on the ski slopes to re-imagining the events industry."
  },
  {
    "name": "Luke Buckley",
    "description": "An experienced event professional with a proven track record in commercial roles both regionally and internationally. Successfully developed and implemented a sales function that now sees VenuIQ as a supplier on the rise in the event industry. Industry research and customer centric decisions have led to sustainable business growth, including the launch of multiple industry needed initiatives like VenuIQ's partner network. Worked with event portfolios of vast ranges – from 50 small events per year to 1 x 30,000 person exhibition."
  },
  {
    "name": "Ewelina Dunkley",
    "description": "Ewelina Dunkley is a globally recognized events and strategy leader with over 16 years of experience designing transformative experiences that drive inclusion, innovation, and community impact.\n\nCurrently serving as Global Events Lead at Wise, she orchestrates impactful and inclusive programs and events worldwide, creating meaningful connections across diverse audiences while advancing the company's mission to build money without borders for everyone, everywhere.\n\nAt Wise, Ewelina leverages her expertise in cross-cultural event design and community building to develop strategic programs that foster global collaboration, celebrate diversity, and drive business outcomes across international markets. Her role encompasses everything from large-scale corporate events and customer experiences to internal culture-building initiatives that strengthen Wise's inclusive, mission-driven workplace.\n\nPrior to Wise, Ewelina served as Global Events & Strategy Manager at Meta, where she led cross-functional programs across 100+ global sites and spearheaded award-winning initiatives like the GameOn Hackathon, which earned Meta the Best DE&I Initiative award in 2022. A passionate advocate for women in tech, she held a pivotal role on the Women@ EMEA steering committee, shaping engagement strategies and empowering women across Meta's international offices. She also served on the Global Hackathon Board of Directors and the Global Community Leader Advisory Committee, amplifying underrepresented voices and fostering inclusive innovation.\n\nEwelina's career journey—from hospitality to high-impact fintech leadership—reflects her resilience, creativity, and commitment to building cultures of belonging. Named Event Planner of the Year at the Miss Jones Awards in 2022 and selected as a finalist for the prestigious Mentor of the Year Award with Fast Forward 15, she continues to inspire through public speaking, mentorship, and her LinkedIn series, \"REAL TALK with Ewelina,\" where she shares candid insights on leadership, career pivots, and navigating transitions in the evolving world of work.\nHer dedication to nurturing the next generation of leaders and fostering inclusive growth has earned her recognition across the industry, cementing her reputation as both a strategic events professional and a transformational mentor."
  },
  {
    "name": "Jessica Magloire",
    "description": "As Key Account Manager at idloom, Jessica Magloire helps event professionals turn projects into success stories. Holding a Master’s in Multilingual Business Communication and having worked in several countries and fields, she brings a keen sense of cross-cultural understanding to her work. With experience in international business development, and project management, she partners with clients to create meaningful impact through technology. A board member of MPI Belgium-Luxembourg, Jessica blends warmth with strategic thinking, using smart tools to simplify event workflows, foster connection, and highlight the real value behind every event."
  },
  {
    "name": "Ewa Gallon",
    "description": "Ewa is a results-driven marketing leader with a proven record in global growth, field, and brand activation strategies that deliver measurable business impact. With deep experience in revenue marketing, she combines data-driven insights with creative campaigns that engage audiences and generate tangible outcomes.\n\nCurrently Senior Global Marketing Manager at GWI, Ewa leads enterprise growth initiatives and field marketing programs that accelerate pipeline and customer acquisition. Her expertise spans brand activations, ABM campaigns, demand generation, and large-scale events -  consistently translating marketing into revenue.\n\nPassionate about real-world ROI and bridging the gap between sales and marketing, Ewa thrives at the intersection of creativity, data, and commercial impact. From orchestrating international sponsorships to building cross-functional go-to-market strategies, she ensures every campaign leaves a measurable footprint on growth."
  },
  {
    "name": "Liam Hayter",
    "description": "Liam Hayter is a seasoned creative technologist with over 20 years’ experience within the media production industry. Currently, Liam is a Product Manager, OEM & Partners at Vizrt, and has been with the company for several years holding roles within professional services and as a senior solutions architect.\n\nSpecialising in live production workflows, Liam has a vast array of experience including within the pro AV, post-production and education realms, and has worked with NDI since its inception. Liam's expertise is driving innovation in rich end-to-end video/audio over IP systems, and he is an expert in problem solving hybrid baseband-IP configurations, IP interoperability, software and cloud live productions. \n\nAs the Product Manager for OEM and Partners, Liam Hayter manages the technology partnerships for Vizrt products and solutions that expand adoptions and interoperability across the AV Broadcast industries."
  }
]
